tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Improved top (interactive process viewer)
brew "htop"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Fast, highly customisable system info script
brew "neofetch"
# Application launcher and productivity software
cask "alfred"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Turn your phone into a webcam
cask "epoccam"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-fira-code"
# Tool to measure the computer system's performance
cask "geekbench"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Support for Logitech G gear
cask "logitech-g-hub"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Organize your ideas and projects into visual boards
cask "milanote"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Remote management solution
cask "royal-tsx"
# Music streaming service
cask "spotify"
cask "twitch"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
